<?php

$mainValues = [
    'banned' => '❌ | Эй, я говорил тебе быть человеком. ты не послушал, теперь ты заблокирован. 😑😂',
    'customer_custome_plan_day' => "⏰|Пожалуйста, введите количество дней, на которые вы подписываетесь\n💰|стоимость за день: DAY-PRICE",
    'customer_custome_plan_volume'=>"🔋|Пожалуйста, введите стоимость вашей услуги в гигабайтах\n💰|стоимость за день: VOLUME-PRICE",
    'customer_custome_plan_name'=>'Введите название конфигурации (введите английские буквы и цифры вместе)',
    'send_user_id'=>"🀄️| Отправьте цифровой идентификатор пользователя: :",
    'enter_decrease_amount'=>"💸 | Введите сумму, которую вы хотите вычесть из:",
    'enter_increase_amount'=>"💸 | Введите сумму, которую вы хотите перечислить:",
    'user_not_found'=>"🥴 | У нас нет никого подобного. Я думаю, ты ошибаешься.",
    'amount_decreased_from_your_wallet'=> "✅ Сумма на вашем счете была уменьшена",
    'amount_decreased_from_user_wallet'=> "✅ Сумма toman была уменьшена с кошелька пользователя",
    'increase_wallet_cart_to_cart'=>"♻️ Дорогая, пришлите мне фотографию депозита. :

🔰 <code>ACCOUNT-NUMBER</code> - HOLDER-NAME

✅ После подтверждения вашего платежа сумма будет зачислена на ваш кошелек!",
    'order_increase_sent'=>"🥇 Ваш заказ был успешно зарегистрирован.
     Я добавлю его в ваш кошелек после подтверждения... 💞",
    'please_send_only_image'=>"Пожалуйста, просто пришлите фотографию.",
    'reached_main_menu'=>"Итак, я вернулся. если у тебя есть чем заняться, скажи мне 😉 / если хочешь, выбери один из вариантов выполнения своей работы.

🚪 /start",
    'increase_wallet_request_message'=>"💳 Спрос (увеличение запасов )

💰Сумма:  PRICE указана
🧑‍💻 Имя : NAME
🎯 Имя пользователя : @USERNAME
🎫Код пользователя: <code>USER-ID</code>
",
    'out_of_connection_capacity'=>'Емкость этого соединения заполнена.',
    'out_of_server_capacity'=>'Этот сервер заполнен.',
    'can_create_specific_account'=> "Вы можете создать учетную запись AMOUNT только по этому тарифному плану.",
    'buy_account_cart_to_cart'=>"♻️ Я отправила фотографию квитанции о внесении депозита или номер для отслеживания, время платежа, имя плательщика в сообщении. :

🔰 <code>ACCOUNT-NUMBER</code> - HOLDER-NAME

✅ После подтверждения вашего платежа ссылка на сервер будет автоматически отправлена вам через этого бота.!",
    'renew_ccount_cart_to_cart'=>"♻️ Пришлите мне фотографию квитанции о внесении депозита или номер для отслеживания, время платежа, имя плательщика в сообщении.:

🔰 <code>ACCOUNT-NUMBER</code> - HOLDER-NAME",
    'order_buy_sent'=>"🛍 Ваш заказ успешно зарегистрирован.
Я отправлю его вам после подтверждения... 🥳",
    'buy_custom_account_request'=>"💓 Купите план. ( TYPE )
    
▫️ Id: USER-ID
👨‍💼اسم کاربر: <a href='tg://user?id=USER-ID'>NAME</a>
⚡️ نام کاربری: @USERNAME
💰مبلغ پرداختی: PRICE تومان
✏️ نام سرویس: REMARK
🔋حجم سرویس: VOLUME گیگ
⏰ مدت سرویس: DAYS روز",
'buy_new_account_request'=>"❗️|💳 خرید جدید ( TYPE )

▫️آیدی کاربر: USER-ID
👨‍💼اسم کاربر: NAME
⚡️ نام کاربری: USERNAME
💰مبلغ پرداختی: PRICE تومان
🚦سرور: SERVERNAME
✏️ نام سرویس: REMARK
🔋حجم سرویس: VOLUME گیگ
⏰ مدت سرویس: DAYS روز",
'buy_new_much_account_request'=>"❗️|💳 خرید جدید ( TYPE )

▫️آیدی کاربر: USER-ID
👨‍💼اسم کاربر: NAME
⚡️ نام کاربری: USERNAME
💰مبلغ پرداختی: PRICE تومان
🏖 تعداد اکانت: ACCOUNT-COUNT
✏️ نام سرویس: REMARK",
'invite_buy_new_account'=>"👨‍👦‍👦 خرید ( زیر مجموعه )

🧝‍♂️آیدی کاربر: USER-ID
🛡اسم کاربر: NAME
🔖 نام کاربری: USERNAME
💰مبلغ پرداختی: PRICE تومان
🔮 نام سرویس: REMARK
💮 سفارش: FILENAME",
    'renew_order_sent'=>"✅| دوست عزیز ، درخواستت با موفقیت ثبت شد، بعد از بررسی و تمدید ادمین کانفیگ رو برات میفرستم ممنون از صبوریت 
    
🚪 /start",
'renew_account_request_message'=>"♻️ تمدید سرویس ( TYPE )

▫️آیدی کاربر: USER-ID
👨‍💼اسم کاربر: NAME
⚡️ نام کاربری: USERNAME
💰مبلغ پرداختی: PRICE تومان
✏️ نام سرویس: REMARK
🔋حجم سرویس: VOLUME گیگ
⏰ مدت سرویس: DAYS روز",
'increase_account_request_message'=>"⏰ درخواست افزایش ( TYPE سرویس )

▫️آیدی کاربر: USER-ID
👨‍💼اسم کاربر: NAME
⚡️ نام کاربری: USERNAME
🎈 نام سرویس: REMARK
🔋TYPE افزایش: INCREASE گیگ/روز
💰قیمت: PRICE تومان",
    'waiting_message'=>'⏳ در حال انتظار ...',
    'join_channel_message'=>"❌ برای استفاده از ربات حتما باید در کانال زیر عضو شوید:
    
✅ بعد از اینکه عضو شدید روی دکمه عضو شدم بزنید

",
    'bot_is_updating'=> "🌛ربات در حال بروزرسانی می باشد ...",
    'select_one_to_show_detail'=> ' 🔅 یکی از سرویس هاتو انتخاب کن و مشخصات کاملش رو ببین :',
    'you_dont_have_config'=>'عزیزم هیچ سفارشی نداری 🙁 باید یه کانفیگ خریداری کنی',
    'no_order_found'=> "موردی یافت نشد",
    'config_details_message'=>"وضعیت کانفیگ: STATE
    
🔮 نام کانفیگ : NAME

لینک اتصال: CONNECT-LINK

لینک سابسکریبشن: SUB-LINK
⁮⁮ ⁮⁮ ⁮⁮ ⁮⁮
",
    'please_wait_message'=>"🙃 | Пожалуйста, подождите. ",
    'send_only_number'=> "😡 | Я не говорю, что ты просто отправляешь номер. ты что, не понимаешь? Или ты сам себя ударил?",
    'change_bot_settings_message'=>'🔰Отключите любую из функций, если ее нет в роботе. !',
    'saved_successfuly'=>"✅|Успешно сохранен",
    'invited_user_joined_message'=>"😍|Поздравляем, кто-то вошел в систему робота по вашей ссылке.",
    'please_select_from_below_buttons'=>"🔘|Пожалуйста, используйте только следующий ключ",
    'use_iranian_number_only'=>"🔘Пожалуйста, используйте только иранский номер,
    'phone_confirmed'=>"✅|Ваш номер был успешно подтвержден.",
    'send_your_phone_number'=>"Здравствуйте, уважаемый, чтобы воспользоваться роботом, отправьте свой контактный номер, используя следующий ключ 👇",
    'start_message'=>'Здравствуйте, добро пожаловать в Ghosstroute robot. 🫡🌸
    
Мы здесь для того, чтобы подключить вас к глобальной сети без каких-либо ограничений ❤️

✅ Качество соединения.
📡 Безопасность в вашем общении.
☎️ Поддерживайте до последнего дня.

🚪 /start',
    'new_member_joined'=>"📢 | Новый цветок - его робота. :

Имя: FULLNAME
Профиль: @USERNAME
ID: USERID

Я думаю, тебе следует отправить ему сообщение. 😍",
    "not_joine_yet"=>"Он еще не является участником канала.",
    'insert_discount_code'=>"🎁|کد تخفیف تو را وارد کن:",
    "not_valid_discount_code"=>"😔|کد تخفیفی که وارد کردی معتبر نیس",
    'valid_discount_code'=>"✅|کد تخفیف با موفقیت استفاده شد
مقدار تخفیف AMOUNT تومان",
'used_discount_code'=>"☑️|🎁 کد تخفیف استفاده شد

🔰آیدی کاربر: USERID
👨‍💼اسم کاربر: NAME
⚡️ نام کاربری: USERNAME
🎁 کد تخفیف: DISCOUNTCODE
💰مقدار تخفیف: AMOUNT تومان
⁮⁮ ⁮⁮",
"send_config_uuid"=>"❗️| لینک کانفیگ یا uuid رو برام بفرس اطلاعات کامل رو تحویلت بدم 🤭",
'not_correct_text'=>"متن وارد شده معتبر نمی باشد",
'receving_information'=>"♻️در حال دریافت جزییات ... ",
'request_agency_message'=>"درخواست نمایندگی

🔰آیدی کاربر: USERID
👨‍💼اسم کاربر: NAME
⚡️ نام کاربری: USERNAME
⁮⁮ ⁮⁮",
    'agency_request_sent'=>"درخواست شما با موفقیت ارسال شد، لطفا منتظر باشید!⁮⁮ ⁮⁮",
    'agency_request_already_sent'=>"درخواست شما قبلاً ارسال شده، لطفا منتظر باشید!⁮⁮ ⁮⁮",
    'agency_request_declined'=>"🥺 درخواست شما برای نمایندگی رد گردید",
    'agency_request_approved'=>"✅ درخواست شما برای نمایندگی تأیید شد",
    'send_agent_discount_percent' =>"لطفا مقدار تخفیف این نمایندگی را  به صورت درصد وارد کنید، مثلا 10",
    'agent_setting_message' =>" 🧚🏻‍♀️ نماینده محترم:

از این بخش میتوانید خرید تکی و خرید انبوه داشته باشید و همچنین کانفیگ های خریداری شده را مدیریت کنید",
    'selling_is_off'=>"فعلا فروش نداریم",
    'no_server_available'=>"😔 | عزیز دلم هیچ سرور فعالی نداریم لطفا بعدا مجدد تست کن",
    'buy_sub_select_location' => '  1️⃣ مرحله یک:

لوکیشن مدنظرت رو برا خرید انتخاب کن: 😊',
    'the_bot_in_not_admin' => "😡|ای بابا ،ربات هنوز تو کانال عضو نشده، اول ربات رو تو کانال ادمین کن و آیدیش رو بفرست",
    'category_not_avilable'=>"هیچ دسته بندی برای این سرور وجود ندارد",
    'receive_categories'=>"♻️ | دریافت دسته بندی ...",
    'buy_sub_select_category'=> "2️⃣ مرحله دوم:

دسته بندی مورد نظرت رو انتخاب کن 🤭",
    'no_plan_available'=>"💡پلنی در این دسته بندی وجود ندارد",
    'receive_plans'=>"📍در حال دریافت لیست پلن ها",
    'buy_sub_select_plan'=> "3️⃣ مرحله سه:

یکی از پلن هارو انتخاب کن و برو برای پرداختش 🤲 🕋", 
    'buy_custom_plan'=>'➕ پلن دلخواه تو بخر',
    'select_one_plan_to_edit'=>"یکی از پلن ها رو انتخاب کن تا برات ویرایشش کنم", 
    'enter_account_amount' => "♻️ تعداد اکانت درخواستی رو وارد کن حداکثر هربار 6 عدد:

⚠️ | نکته: در صورت وارد کردن به مقدار بالا احتمالا اکانت ساخته نشود و پنل x-ui گیر کند",
    'send_positive_number'=>"لطفا عددی بزرگتر از 0 وارد کنید",
    'buy_subscription_detail'=>"〽️ نام پلن: PLAN-NAME
        ➖➖➖➖➖➖➖
        💎 قیمت پنل : PRICE
        ➖➖➖➖➖➖➖
        📃 توضیحات :
        DESCRIPTION
        ➖➖➖➖➖➖➖",
    'buy_much_subscription_detail'=>"〽️ نام پلن: PLAN-NAME
        تعداد اکانت: ACCOUNT-COUNT
        قیمت پنل: PRICE
        ➖➖➖➖➖➖➖
        💎 قیمت کل : TOTAL-PRICE
        ➖➖➖➖➖➖➖
        📃 توضیحات :
        DESCRIPTION
        ➖➖➖➖➖➖➖",
    'buy_custom_subscription_detail'=>"〽️ نام پلن: PLAN-NAME
        حجم اختصاصی: VOLUME GB
        مدت اختصاصی: DAYS روز
        ➖➖➖➖➖➖➖
        💎 قیمت پنل : PRICE
        ➖➖➖➖➖➖➖
        📃 توضیحات :
        DESCRIPTION
        ➖➖➖➖➖➖➖",
    "agents_list" => "🔍 لیست نمایندگان:

جهت مشاده آمار فروش نمایندگان روی اسم نماینده کلیک کنید، همچنین میتوانید برای نماینده درصد تعیین کنید یا آن را از لیست نمایندگان خارج کنید",
    'agent_deleted_successfuly'=>"نمایندگی با موفقیت حذف شد",
    'agent_details'=>'🙎‍♂️اطلاعات نماینده AGENT-NAME

سمت راست درآمد و سمت چپ تعداد خرید نماینده می باشد',
    'send_config_remark'=>"لطفا ریمارک کانفیگ را وارد کنید",
    'forward_your_message'=>"لطفا پیام مورد نظر خود را به ربات فروارد کنید",
    "enter_ticket_title"=>"💠لطفا موضوع تیکت را ارسال کنید!",
    "enter_ticket_description"=> "💠لطفا متن و یا عکس تیکت را بصورت ساده و مختصر ارسال کنید!",
    "sent_config_to_user"=> '✅ کانفیگ و براش ارسال کردم
ریمارک: REMARK
حجم سرویس: VOLUME گیگ
مدت زمان سرویس: DAYS روز',
    "renewed_config_to_user"=> '✅ کانفیگ و براش تمدید کردم
ریمارک: REMARK
حجم سرویس: VOLUME گیگ
مدت زمان سرویس: DAYS روز',
    'sending_config_to_user'=>'🚀 | 😍 در حال ارسال کانفیگ به مشتری ...',
    'config_not_found'=>"مشکلی پیش اومده، دوباره از نو انجام بده",
    'incorrect_config_name'=>"😡|اسم وارد شده معتبر نمی باشد",
    'pay_with_tron_wallet'=>"♻️ عزیزم مبلغ AMOUNT ترون رو به والت زیر ارسال کن و تکسید آیدی واریزی ترون رو برام ارسال کن :

🔰 <code>TRON-WALLET</code>",
    'incorrect_tax_id'=>"تکسید آیدی وارد شده نامعتبر است",
    'used_tax_id'=>"این تکسید آیدی قبلا استفاده شده است",
    'in_review_tax_id'=>"تراکنش شما در صف بررسی قرار گرفت",
    'user_taxid_rejected'=>"تراکنش ناموفق TYPE (ترون)
    
آیدی کاربر: USERID
اسم: NAME
یوزرنیم: USERNAME

تکسید آیدی: TAXID

<b>بعد از 5 تلاش رد گردید</b>",
    'your_taxid_rejected'=>"تراکنش TYPE شما با تکسید آیدی: TAXID

<b>بعد از 5 تلاش رد شد</b>",
    'incorrect_user_taxid_rejected'=>"تراکنش ناموفق TYPE (ترون)
    
آیدی کاربر: USERID
اسم: NAME
یوزرنیم: USERNAME

تکسید آیدی: TAXID

<b>به دلیل ثبت تراکنش نادرست رد شد</b>",
    'your_incorrect_taxid_rejected'=>"تراکنش TYPE شما با تکسید آیدی: TAXID

<b>به دلیل ثبت تراکنش نادرست رد شد</b>",
    'partially_paid_user_taxid'=>"تراکنش ناموفق TYPE (ترون)
    
آیدی کاربر: USERID
اسم: NAME
یوزرنیم: USERNAME

تکسید آیدی: TAXID

<b>به دلیل عدم مطابقت مبلغ تراکنش رد شد</b>",
    'you_have_partially_paid'=>"تراکنش TYPE شما با تکسید آیدی: TAXID

<b>به دلیل عدم مطابقت مبلغ تراکنش رد شد</b>",
    'agent_discount_settings'=>"مدیریت تخفیف های نماینده AGENT-NAME"
];

$buttonValues = [
    'bot_reports'=>"📉 Общая статистика",
    'message_to_user'=>"📞 Личное сообщение",
    'user_reports'=>"🔑 Данные пользователя",
    'admins_list'=>"👤 Список администраторов",
    'increase_wallet'=>"💵 Увеличенный запас",
    'decrease_wallet'=>"💸Сокращение запасов",
    'create_account'=>"⌨️ Создание массовой учетной записи",
    'ban_user'=>"❌ Блокирование пользователя",
    'unban_user'=>"✅ Освобождение пользователя",
    'server_settings'=>'🚦Управление сервером и настройки',
    'categories_settings'=>'🗂 Категорийное управление',
    'plan_settings'=>'🪣 Управление планами',
    'discount_settings'=>"🎁 Управление скидками",
    'main_button_settings'=>"🕹 Управление кнопками ",
    'gateways_settings'=>'💳 Настройки порта и канала',
    'bot_settings'=>'⚙️ Настройки робота',
    'tickets_list'=>'📪 Билеты',
    'message_to_all'=>"📨 Отправка публичного сообщения",
    'forward_to_all'=>"📨 Это послание универсально.",
    'back_to_main'=>'⤵️ Вернитесь в главное меню ',  
    'cart_to_cart'=>"💳 Карта к карте.",
    'now_payment_gateway'=>"💳  Оплата сейчас",
    'zarinpal_gateway'=> "💳 Золотые врата Павла",
    'nextpay_gateway'=>"💳 Следующая дверь.",
    'weswap_gateway'=>"💳 Портал о реальной валюте",
    'approve' => 'Подтверждение ✅',
    'approved' => 'Подтвержденный.',
    'decline' => 'Неодобрение ❌',
    'declined' => 'Отклоненный.',
    'back_button'=> "Назад 🔙",
    'renew_connection_link'=>"🚷 Отключите доступ и новые ссылки.",
    'update_config_connection'=>"⌛️ Обновление конфигурации",
    'increase_config_volume'=>"🩸 Увеличенный объем обслуживания",
    'increase_config_days'=>"📆 Увеличенное время обслуживания",
    'renew_config'=>' Продление срока службы',
    'change_config_location'=>'🌎 Смена местоположения',
    'selected_protocol'=>"🚦 Выборочный протокол",
    'volume_left'=>"⏳ Остаточный объем:",
    'expire_date'=>"⏰  Срок годности: ",
    'buy_date'=>"⏰ Дата покупки: ",
    'plan_name'=>" 🚀 Название плана: ",
    'on'=>"Яркий ✅",
    'off'=>"Прочь ❌",
    'active'=>"Активный 🟢",
    'deactive'=>"Нетрудоспособный 🔴",
    'send_phone_number'=>'☎️ Пришлите номер.',
    'send_message_to_user'=>"✉️ Отправить сообщение пользователю ",
    'cancel' => '😪 Я сдался. давай.',
    'join_channel'=>"Подпишитесь на канал",
    'have_joined'=>"Я присоединился. ✅",
    'gift_volume_day'=>"🎯 Дар объема и времени",
    'test_account'=>"🎁 Получение тестовой учетной записи",
    'invite_friends'=>"🏆 Подмножество",
    'my_info'=>"🧑‍💼Счет",
    'my_subscriptions'=>'📱 Мои настройки.',
    'buy_subscriptions'=>'🛒  Купите новую конфигурацию',
    'shared_existence'=>"❕Общий инвентарь ",
    'individual_existence'=>"❗️ Специальный инвентарь ",
    'application_links'=>'🧩 Обучение подключению',
    'my_tickets'=>"📨 Мои билеты.",
    'search_config'=>"🪫 Технические характеристики конфигурации",
    'delete_config'=>"❌ Устранение конфигурации",
    'pay_with_wallet' => "💰 Оплата по инвентарю",
    'request_agency' =>"🧑‍💼 Просьба о представлении🧑‍💼",
    'agency_setting' =>"➰ Совместная панель ➰",
    'agent_one_buy'=>"➕ Единичная покупка",
    'agent_much_buy'=>" Массовые покупки",
    'agent_bought_accounts'=>"Количество покупок",
    'agent_joined_date'=>"Дата вступления в члены",
    'agent_agency_date'=>"История представительства",
    "agent_list"=>" 📍 Делегирование управления 📍",
    'search_agent_config'=>"Поиск конфигурации",
    'search_admin_config'=>"Поиск пользовательской конфигурации",
    'sharj'=>"✅ 💳 - Квитанция. - пополнение кошелька.",
    "qr_config"=>"🔳 Конфигурация QR-кода",
    "qr_sub"=>"🔳 QR Saab",
    'start_bot'=>"Запуск робота",
    'enable_config'=>"Активация конфигурации",
    'disable_config'=>"Отключить настройку",
    "tron_gateway"=>"Порт Tron",
    'plan_discount'=>"По плану.",
    'server_discount'=>"На сервере."
];
?>
